
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 2 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
* Replace
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-servicebus-connection-string/9c82180afd39415cba2bfab51c8c5295"
        name                    = "civil-sdt-servicebus-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-servicebus-shared-access-key/1db0c23a59774e479949868496584275"
        name                    = "civil-sdt-servicebus-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ capacity                            = 1 -> 0
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://civil-sdt-servicebus-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" -> (known after apply)
      ~ minimum_tls_version                 = "1.2" -> (known after apply)
        name                                = "civil-sdt-servicebus-aat"
      ~ premium_messaging_partitions        = 1 -> 0 # forces replacement
      ~ sku                                 = "Premium" -> "Standard" # forces replacement
        tags                                = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#civil-sdt"
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-sdt.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
      ~ zone_redundant                      = true -> false # forces replacement
        # (4 unchanged attributes hidden)

      ~ network_rule_set {
          + capacity                            = (known after apply)
          + default_primary_connection_string   = (known after apply)
          + default_primary_key                 = (known after apply)
          + default_secondary_connection_string = (known after apply)
          + default_secondary_key               = (known after apply)
          + endpoint                            = (known after apply)
          + id                                  = (known after apply)
          + local_auth_enabled                  = (known after apply)
          + location                            = (known after apply)
          + minimum_tls_version                 = (known after apply)
          + name                                = (known after apply)
          + premium_messaging_partitions        = (known after apply)
          + public_network_access_enabled       = (known after apply)
          + resource_group_name                 = (known after apply)
          + sku                                 = (known after apply)
          + tags                                = (known after apply)
          + zone_redundant                      = (known after apply)
        } -> (known after apply)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "civil-sdt-servicebus-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "civil-sdt-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ batched_operations_enabled              = true -> (known after apply)
      ~ express_enabled                         = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "civil-sdt-in-out-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
      ~ partitioning_enabled                    = false -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

Changes to Outputs:
  ~ sb_primary_send_and_listen_connection_string = (sensitive value)
  ~ sb_primary_send_and_listen_shared_access_key = (sensitive value)
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":591,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->